
{{alias}}( x )
    Computes the absolute value of `x`.

    Parameters
    ----------
    x: double
        Input value.

    Returns
    -------
    y: double
        Absolute value.

    Examples
    --------
    > var v = {{alias}}( -1.0 )
    1.0
    > v = {{alias}}( 2.0 )
    2.0
    > v = {{alias}}( 0.0 )
    0.0
    > v = {{alias}}( -0.0 )
    0.0
    > v = {{alias}}( NaN )
    NaN

    See Also
    --------

