
{{alias}}( x )
    Returns an integer corresponding to the unbiased exponent of a
    single-precision floating-point number.

    Parameters
    ----------
    x: float
        Single-precision floating-point number.

    Returns
    -------
    out: integer
        Unbiased exponent.

    Examples
    --------
    > var exp = {{alias}}( {{alias:@stdlib/math/base/utils/float64-to-float32}}( 3.14e34 ) )
    114 => 2**114 ~ 2.08e34
    > exp = {{alias}}( {{alias:@stdlib/math/base/utils/float64-to-float32}}( 3.14e-34 ) )
    -112 => 2**-112 ~ 1.93e-34
    > exp = {{alias}}( {{alias:@stdlib/math/base/utils/float64-to-float32}}( -3.14 ) )
    1
    > exp = {{alias}}( 0 )
    0
    > exp = {{alias}}( NaN )
    128

    See Also
    --------

