
{{alias}}( x )
    Evaluates the gamma function.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Function value.

    Examples
    --------
    > var v = {{alias}}( 4.0 )
    6.0
    > v = {{alias}}( -1.5 )
    ~2.363
    > v = {{alias}}( -0.5 )
    ~-3.545
    > v = {{alias}}( 0.5 )
    ~1.772
    > v = {{alias}}( 0.0 )
    infinity
    > v = {{alias}}( -0.0 )
    -infinity
    > v = {{alias}}( NaN )
    NaN

    See Also
    --------

