
{{alias}}( x, y )
    Evaluates the beta function.

    Parameters
    ----------
    x: double
        First function parameter (non-negative).

    y: double.
        Second function parameter (non-negative).

    Returns
    -------
    out: double
        Evaluated beta function.

    Examples
    --------
    > var v = {{alias}}( 0.0, 0.0 )
    infinity
    > v = {{alias}}( 1.0, 1.0 )
    1.0
    > v = {{alias}}( -1.0, 2.0 )
    NaN
    > v = {{alias}}( 5.0, 0.2 )
    ~3.382
    > v = {{alias}}( 4.0, 1.0 )
    0.25
    > v = {{alias}}( NaN, 2.0 )
    NaN

    See Also
    --------

