
{{alias}}( x )
    Decomposes a double-precision floating-point number into integral and
    fractional parts, each having the same type and sign as the input value.

    Parameters
    ----------
    x: number
        Input value:

    Returns
    -------
    arr: Array<double>
        Array containing integral and fractional parts.

    Examples
    --------
    > var parts = {{alias}}( 3.14 )
    [ 3.0, 0.14000000000000012 ]
    > parts = {{alias}}( 3.14 )
    [ 3.0, 0.14000000000000012 ]
    > parts = {{alias}}( +0.0 )
    [ +0.0, +0.0 ]
    > parts = {{alias}}( -0.0 )
    [ -0.0, -0.0 ]
    > parts = {{alias}}( {{alias:@stdlib/math/constants/float64-pinf}} )
    [ infinity, +0.0 ]
    > parts = {{alias}}( {{alias:@stdlib/math/constants/float64-ninf}} )
    [ -infinity, -0.0 ]
    > parts = {{alias}}( NaN )
    [ NaN, NaN ]

    See Also
    --------

