
{{alias}}( x )
    Evaluates the base `2` exponential function.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Function value.

    Examples
    --------
    > var v = {{alias}}( 3.0 )
    8.0
    > v = {{alias}}( -9.0 )
    ~0.002
    > v = {{alias}}( 0.0 )
    1.0
    > v = {{alias}}( NaN )
    NaN

    See Also
    --------

