
{{alias}}( x )
    Computes the cube root.

    Parameters
    ----------
    x: double
        Input value.

    Returns
    -------
    y: double
        Cube root.

    Examples
    --------
    > var v = {{alias}}( 64.0 )
    4.0
    > v = {{alias}}( 27.0 )
    3.0
    > v = {{alias}}( 0.0 )
    0.0
    > v = {{alias}}( -0.0 )
    -0.0
    > v = {{alias}}( -9.0 )
    ~-2.08
    > v = {{alias}}( NaN )
    NaN

    See Also
    --------

