
{{alias}}( x )
    Returns the minimum value.

    The implementation ignores the sign of `0`.

    The implementation does not check for `NaN` arguments.

    Parameters
    ----------
    x: double
        First number.

    y: double
        Second number.

    Returns
    -------
    out: double
        Minimum value.

    Examples
    --------
    > var v = {{alias}}( 3.14, 4.2 )
    3.14
    > v = {{alias}}( 3.14, NaN )
    NaN
    > v = {{alias}}( NaN, 3.14 )
    3.14
    > v = {{alias}}( -0.0, +0.0 )
    +0.0
    > v = {{alias}}( +0.0, -0.0 )
    -0.0

    See Also
    --------

