
{{alias}}( b, x )
    Evaluates the exponential function, i.e. `bË£`.

    Parameters
    ----------
    b: double
        Base.

    x: double
        Exponent.

    Returns
    -------
    y: double
        Function value.

    Examples
    --------
    > var v = {{alias}}( 2.0, 3.0 )
    8.0
    > v = {{alias}}( 4.0, 0.5 )
    2.0
    > v = {{alias}}( 100.0, 0.0 )
    1.0
    > v = {{alias}}( {{alias:@stdlib/math/constants/float64-pi}}, 5.0 )
    ~306.0197
    > v = {{alias}}( {{alias:@stdlib/math/constants/float64-pi}}, -0.2 )
    ~0.7954
    > v = {{alias}}( NaN, 3.0 )
    NaN
    > v = {{alias}}( 5.0, NaN )
    NaN
    > v = {{alias}}( NaN, NaN )
    NaN

    See Also
    --------

