
{{alias}}( x, x0, Ɣ )
    Evaluates the quantile function for a Cauchy distribution with scale
    parameter `Ɣ` and location parameter `x0` at a value `x`.

    If provided `NaN` as any argument, the function returns `NaN`.

    If provided `Ɣ <= 0`, the function returns `NaN`.

    Parameters
    ----------
    x: number
        Input value.

    x0: number
        Location parameter.

    Ɣ: number
        Scale parameter.

    Returns
    -------
    out: double
        Evaluated quantile function.

    Examples
    --------
    > var y = {{alias}}( 0.3, 2.0, 2.0 )
    ~0.547
    > y = {{alias}}( 0.8, 10, 2.0 )
    ~12.753
    > y = {{alias}}( 0.1, 10.0, 2.0 )
    ~3.845
    > y = {{alias}}( 1.1, 0.0, 1.0 )
    NaN
    > y = {{alias}}( -0.2, 0.0, 1.0 )
    NaN
    > y = {{alias}}( NaN, 0.0, 1.0 )
    NaN
    > y = {{alias}}( 0.0, NaN, 1.0 )
    NaN
    > y = {{alias}}( 0.0, 0.0, NaN )
    NaN
    // Negative scale parameter:
    > y = {{alias}}( 0.5, 0.0, -1.0 )
    NaN


{{alias}}.factory( x0, Ɣ )
    Returns a function for evaluating quantile function for a Cauchy
    distribution with scale parameter `Ɣ` and location parameter `x0`.

    Parameters
    ----------
    x0: number
        Location parameter.

    Ɣ: number
        Scale parameter.

    Returns
    -------
    quantile: Function
        Quantile function.

    Examples
    --------
    > var myQuantile = {{alias}}.factory( 10.0, 2.0 );
    > var y = myQuantile( 0.5 )
    10.0

    See Also
    --------

