
{{alias}}( x )
    Computes the absolute value.

    If provided a number, the function returns a number.

    If provided an ndarray or array-like object, the function performs element-
    wise iteration and returns an ndarray having the same shape as `x` and
    containing element-wise results.

    Parameters
    ----------
    x: ndarray|ArrayLikeObject|number
        Input value.

    Returns
    -------
    y: ndarray|number
        Element-wise results.

    Examples
    --------
    // Provide a number:
    > var y = {{alias}}( -1.0 )
    1.0

    // Provide an array-like object:
    > var x = new {{alias:@stdlib/array/float64}}( [ -1.0, -2.0 ] );
    > y = {{alias}}( x )
    <ndarray>
    > y.data
    <Float64Array>[ 1.0, 2.0 ]

    // Provide an ndarray:
    > x = {{alias:@stdlib/ndarray/array}}( [ [ -1.0, -2.0 ], [ -3.0, -4.0 ] ] );
    > y = {{alias}}( x )
    <ndarray>
    > y.get( 0, 1 )
    2.0

    See Also
    --------

