
{{alias}}( x, y )
    Computes the absolute difference.

    Parameters
    ----------
    x: double
        First number.

    y: double
        Second number.

    Returns
    -------
    out: double
        Absolute difference.

    Examples
    --------
    > var d = {{alias}}( 2.0, 5.0 )
    3.0
    > d = {{alias}}( -1.0, 3.14 )
    ~4.14
    > d = {{alias}}( 10.1, -2.05 )
    ~12.15
    > d = {{alias}}( -0.0, 0.0 )
    +0.0
    > d = {{alias}}( NaN, 5.0 )
    NaN
    > d = {{alias}}( Number.POSITIVE_INFINITY, Number.NEGATIVE_INFINITY )
    Number.POSITIVE_INFINITY
    > d = {{alias}}( Number.POSITIVE_INFINITY, Number.POSITIVE_INFINITY )
    NaN

    See Also
    --------

