
{{alias}}( x )
   Evaluates the base `10` exponential function.

    Parameters
    ----------
    x: double
        Input value.

    Returns
    -------
    y: double
        Function value.

    Examples
    --------
    > var v = {{alias}}( 3.0 )
    1000
    > v = {{alias}}( -9.0 )
    1e-9
    > v = {{alias}}( 0.0 )
    1.0
    > v = {{alias}}( NaN )
    NaN

    See Also
    --------

