
{{alias}}( x, λ, k )
    Evaluates the moment-generating function (MGF) for a Weibull distribution
    with scale parameter `λ` and shape parameter `k` at a value `t`.

    If provided `NaN` as any argument, the function returns `NaN`.

    If provided a non-positive value for `λ` or `k`, the function returns `NaN`.

    Parameters
    ----------
    x: number
        Input value.

    λ: number
        Scale parameter.

    k: number
        Shape parameter.

    Returns
    -------
    out: number
        Evaluated MGF.

    Examples
    --------
    > var y = {{alias}}( 1.0, 0.5, 1.0 )
    ~2.0
    > y = {{alias}}( -1.0, 4.0, 4.0 )
    ~0.019

    > y = {{alias}}( NaN, 1.0, 1.0 )
    NaN
    > y = {{alias}}( 0.0, NaN, 1.0 )
    NaN
    > y = {{alias}}( 0.0, 1.0, NaN )
    NaN

    > y = {{alias}}( 0.2, -1.0, 0.5 )
    NaN
    > y = {{alias}}( 0.2, 0.0, 0.5 )
    NaN

    > y = {{alias}}( 0.2, 0.5, -1.0 )
    NaN
    > y = {{alias}}( 0.2, 0.5, 0.0 )
    NaN


{{alias}}.factory( λ, k )
    Returns a function for evaluating the moment-generating function (MGF) of a
    Weibull distribution with scale parameter `λ` and shape parameter `k`.

    Parameters
    ----------
    λ: number
        Scale parameter.

    k: number
        Shape parameter.

    Returns
    -------
    mgf: Function
        Moment-generating function (MGF).

    Examples
    --------
    > var myMGF = {{alias}}.factory( 10.0, 8.0 );
    > var y = myMGF( 0.8 )
    ~3150.149
    > y = myMGF( 0.08 )
    ~2.137s

    See Also
    --------

