
{{alias}}( x )
    Evaluates the common logarithm (logarithm with base 10).

    For negative numbers, the common logarithm is not defined.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Function value.

    Examples
    --------
    > var v = {{alias}}( 100.0 )
    2.0
    > v = {{alias}}( 8.0 )
    ~0.903
    > v = {{alias}}( 0.0 )
    -infinity
    > v = {{alias}}( {{alias:@stdlib/math/constants/float64-pinf}} )
    infinity
    > v = {{alias}}( NaN )
    NaN
    > v = {{alias}}( -4.0 )
    NaN

    See Also
    --------

