
{{alias}}( x )
    Evaluates the natural exponential function.

    Parameters
    ----------
    x: double
        Input value.

    Returns
    -------
    y: double
        Function value.

    Examples
    --------
    > var v = {{alias}}( 4.0 )
    ~54.5982
    > v = {{alias}}( -9.0 )
    ~1.234e-4
    > v = {{alias}}( 0.0 )
    1.0
    > v = {{alias}}( NaN )
    NaN

    See Also
    --------

