
{{alias}}( x )
    Computes `exp(x) - 1`, where `exp(x)` is the natural exponential function.

    Parameters
    ----------
    x: double
        Input value.

    Returns
    -------
    y: double
        Function value.

    Examples
    --------
    > var v = {{alias}}( 0.2 )
    ~0.221
    > v = {{alias}}( -9.0 )
    ~-0.999
    > v = {{alias}}( 0.0 )
    0.0
    > v = {{alias}}( NaN )
    NaN

    See Also
    --------

