
{{alias}}( x )
    Returns an integer corresponding to the significand of a single-precision
    floating-point number.

    Parameters
    ----------
    x: float
        Single-precision floating-point number.

    Returns
    -------
    out: integer
        Significand.

    Examples
    --------
    > var s = {{alias}}( {{alias:@stdlib/math/base/utils/float64-to-float32}}( 3.14e34 ) ) // => 10000011000010001110111
    4293751
    > s = {{alias}}( {{alias:@stdlib/math/base/utils/float64-to-float32}}( 3.14e-34 ) ) // => 10100001011000001010101
    5288021
    > s = {{alias}}( {{alias:@stdlib/math/base/utils/float64-to-float32}}( -3.14 ) ) //  => 10010001111010111000011
    4781507
    > s = {{alias}}( 0.0 ) // => 00000000000000000000000
    0
    > s = {{alias}}( NaN ) // => 10000000000000000000000
    4194304

    See Also
    --------

