
{{alias}}( x )
    Evaluates the binary logarithm (base two).

    For negative numbers, the binary logarithm is not defined.

    Parameters
    ----------
    x: double
        Input value.

    Returns
    -------
    y: double
        Function value.

    Examples
    --------
    > var v = {{alias}}( 4.0 )
    2.0
    > v = {{alias}}( 8.0 )
    3.0
    > v = {{alias}}( 0.0 )
    -infinity
    > v = {{alias}}( {{alias:@stdlib/math/constants/float64-pinf}} )
    infinity
    > v = {{alias}}( NaN )
    NaN
    > v = {{alias}}( -4.0 )
    NaN

    See Also
    --------

